# Database Administration

## HR Database

<img src = "../Data/HR ERD.png">

## Imports & Creating Connection

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [3]:
#import json
#with open('/Users/sherlin01/.secret/mysql.json') as f:
   # login = json.load(f)
#login.keys()

In [4]:
username = 'root'
password = 'root'

In [6]:
connection = f"mysql+pymysql://{username}:{password}@localhost/hr"
engine = create_engine(connection)

In [7]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Showing Tables

In [8]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_hr
0   department
1     employee
2          job
3  job_history

## Showing Empty Tables

In [9]:
q= '''SELECT * FROM department'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [DEPT_ID_DEP, DEP_NAME, MANAGER_ID, LOC_ID, created_at, updated_at]
Index: []

In [10]:
q= '''SELECT * FROM employee'''
pd.read_sql(q, engine)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID,created_at,updated_at
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2,2023-11-30 17:07:47,2023-11-30 17:08:00
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5,2023-11-30 17:07:47,2023-11-30 17:08:00
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5,2023-11-30 17:07:47,2023-11-30 17:08:00
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5,2023-11-30 17:07:47,2023-11-30 17:08:00
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2,2023-11-30 17:07:47,2023-11-30 17:08:00
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2,2023-11-30 17:07:47,2023-11-30 17:08:00
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7,2023-11-30 17:07:47,2023-11-30 17:08:00
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7,2023-11-30 17:07:47,2023-11-30 17:08:00
8,E1009,Andrea,Jones,123414,1990-07-09,F,"120 Fall Creek, Gary,IL",234,70000.0,30003,7,2023-11-30 17:07:47,2023-11-30 17:08:00
9,E1010,Ann,Jacob,123415,1982-03-30,F,"111 Britany Springs,Elgin,IL",220,70000.0,30004,5,2023-11-30 17:07:47,2023-11-30 17:08:00

In [12]:
q= '''SELECT * FROM job'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [JOB_IDENT, JOB_TITLE, MIN_SALARY, MAX_SALARY, created_at, updated_at]
Index: []

In [13]:
q= '''SELECT * FROM job_history'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [EMPL_ID, START_DATE, DEPT_ID, JOBS_ID, created_at, updated_at]
Index: []

## Importing Data into Notebook

In [14]:
department = pd.read_csv('Data/Department-data.csv')
department.info()
department.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   dept_id_dep  3 non-null      int64
 1   dep_name     3 non-null      object
 2   manager_id   3 non-null      int64
 3   loc_id       3 non-null      object
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

   dept_id_dep         dep_name  manager_id loc_id
0            2  Architect Group       30001  L0001
1            5   Software Group       30002  L0002
2            7      Design Team       30003  L0003

In [15]:
employees = pd.read_csv('Data/Employee-data.csv')
employees.info()
employees.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  8 non-null      object
 1   f_name       8 non-null      object
 2   l_name       8 non-null      object
 3   ssn          8 non-null      int64
 4   birth_date   8 non-null      object
 5   sex          8 non-null      object
 6   address      8 non-null      object
 7   job_id       8 non-null      int64
 8   salary       8 non-null      int64
 9   manager_id   8 non-null      int64
 10  dep_id       8 non-null      int64
dtypes: int64(5), object(6)
memory usage: 832.0+ bytes

,employee_id,f_name,l_name,ssn,birth_date,sex,address,job_id,salary,manager_id,dep_id
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5
2,E1003,Steve,Wells,123458,08/10/1980,M,"291 Springs, Gary,IL",300,50000,30002,5
3,E1004,Santosh,Kumar,123459,07/20/1985,M,"511 Aurora Av, Aurora,IL",400,60000,30004,5
4,E1005,Ahmed,Hussain,123410,01/04/1981,M,"216 Oak Tree, Geneva,IL",500,70000,30001,2

In [16]:
job = pd.read_csv('Data/Jobs-data.csv')
job.info()
job.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   job_ident   10 non-null     int64
 1   job_title   10 non-null     object
 2   min_salary  10 non-null     int64
 3   max_salary  10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

   job_ident              job_title  min_salary  max_salary
0        100          Sr. Architect       60000      100000
1        200  Sr.Software Developer       60000       80000
2        300  Jr.Software Developer       40000       60000
3        400  Jr.Software Developer       40000       60000
4        500          Jr. Architect       50000       70000

In [17]:
job_history = pd.read_csv('Data/Job_History-data.csv')
job_history.info()
job_history.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   empl_id     10 non-null     object
 1   start_date  10 non-null     object
 2   dept_id     10 non-null     int64
 3   jobs_id     10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

  empl_id  start_date  dept_id  jobs_id
0   E1001  08/01/2000      100        2
1   E1002  08/01/2001      200        5
2   E1003  08/16/2001      300        5
3   E1004  08/16/2000      400        5
4   E1005  05/30/2000      500        2

## Loading Data into Tables

### Department

In [ ]:
# Checking describe's Field names
q = '''DESCRIBE department

In [ ]:
# Checking dataframe's columns

In [ ]:
# replace original column names

In [ ]:
# Reviewing SQL table's data types

In [ ]:
# Reviewing dataframe's data types

In [ ]:
# confirm the data has been added

In [ ]:
# check the describe again to confirm no changes

### Employee

In [ ]:
# Checking describe's Field names

In [ ]:
# Checking dataframe's columns

In [ ]:
# replace original column names

In [ ]:
# Rename columns to match SQL table

In [ ]:
# Reviewing SQL table's data types

In [ ]:
# Reviewing dataframe's data types

In [ ]:
# Converting B_DATE to datetime dtype

#### We hit an unexpected "Integrity Error" related to foreign key constraints.

- By default, MySQL won't allow us to insert new data into 1 table if we have not yet included the connected data in a related table.
- In this case, it would not let us add to the Employee table because we included ID columns that are the foreign keys for another table.
- We can temporarily deactivate this constraint and then re-run the to_sql command.

#### Handling Foreign Key Constraints

In [ ]:
# Checking the setting for FOREIGN_KEY_CHECKS

- Whenever we need to run a query that does not return data, we will need to use the connection object to .execute the query instead of using pd.read.sql.

In [ ]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection

In [ ]:
# Confirm the checks are deactiavated

- We have deactivated the checks (the value is 0). Now we can try the to_sql command again!

In [ ]:
# Inserting the data now that foreign key checks are disabled

In [ ]:
# confirm the data has been added

In [ ]:
# check the describe again to confirm no changes

### Job

In [ ]:
# Checking describe's Field names

In [ ]:
# Checking dataframe's columns

In [ ]:
# replace original column names

In [ ]:
# Reviewing SQL table's data types

In [ ]:
# Reviewing dataframe's data types

In [ ]:
# confirm the data has been added

In [ ]:
# check the describe again to confirm no changes

### Job History

In [ ]:
# Checking describe's Field names

In [ ]:
# Checking dataframe's columns

In [ ]:
# replace original column names

In [ ]:
# Reviewing SQL table's data types

In [ ]:
# Reviewing dataframe's data types

In [ ]:
# Converting START_DATE to datetime dtype

In [ ]:
# confirm the data has been added

In [ ]:
# check the describe again to confirm no changes

## Running Test Query To Verify Data
- Display the first name, last name, job title, start date and deparment of Alice James.